Revit 2024 API
ProjectLocationSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual ProjectLocationSetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As ProjectLocationSetIterator
Visual C++
public:
virtual ProjectLocationSetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
ProjectLocationSet Class
Autodesk.Revit.DB Namespace